exploring-racket-forms-define-and-letrec.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-03-04 Sat 00:18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Exploring Racket Forms: define and letrec</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Bryan Garza">
<meta name="description" content="How define desugars in Racket"
>
<meta name="keywords" content="racket, scheme, desugar, define, let, letrec">

<link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
<link href="./css/styles2.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="./css/styles.css"/>
</head>
<body>
<div id="preamble" class="status">
<h1 class="title"><a href="http://bryangarza.github.io">Bryan Garza</a></h1>
</div>
<div id="content">
<p>
<div class="outline-3"><h3><a href="./exploring-racket-forms-define-and-letrec.html"> Exploring Racket Forms: define and letrec</a><span> </span><span class="timestamp-wrapper"><span class="timestamp">( March 11, 2016)</span></span></h3>
</p>

<p>
A couple weeks ago I was trying to understand why expressions like this were
valid:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-function-name">future-bound</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">define</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-function-name">f</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">(</span>+ x 1<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">define</span> <span class="org-function-name">x</span> 5<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>f<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Why can you define the <code>x</code> after its usage in <code>f</code>? I initially thought that <code>define</code>
desugared into nested <code>let</code>&rsquo;s or perhaps <code>let*</code>, like this:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">[</span>f <span class="org-rainbow-delimiters-depth-4">(</span>+ x 1<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">[</span>x 5<span class="org-rainbow-delimiters-depth-4">]</span><span class="org-rainbow-delimiters-depth-3">)</span>
    f<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">let*</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">[</span>f <span class="org-rainbow-delimiters-depth-4">(</span>+ x 1<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">]</span>
       <span class="org-rainbow-delimiters-depth-3">[</span>x 5<span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">)</span>
  f<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
But neither made sense, since we still have the same problem of <code>x</code> being bound
after <code>f</code> is bound. It turns out that <code>define</code> desugars into <code>letrec</code>:
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">letrec</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">[</span>f <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">&#955;</span> <span class="org-rainbow-delimiters-depth-5">()</span> <span class="org-rainbow-delimiters-depth-5">(</span>+ x 1<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">]</span>
         <span class="org-rainbow-delimiters-depth-3">[</span>x 5<span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>f<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
This works because <code>letrec</code> initializes the bindings for each of the symbols, to
something akin to <code>undefined</code>. After that, all bindings are initialized to their
values at once. This allows bindings to reference others before those bindings&rsquo;
definitions exist. The value of <code>x</code> in <code>f</code> is only looked up once <code>f</code> is
evaluated. We&rsquo;re referencing symbols statically, but the lookup is dynamic. That
means anything any symbols referencing symbols that come after have to be
wrapped in a <code>lambda</code>; if you try to look up too early, it won&rsquo;t work.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-comment-delimiter">; </span><span class="org-comment">Trying to reference a value immediately</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">letrec</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">[</span>six <span class="org-rainbow-delimiters-depth-4">(</span>+ x 1<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">]</span>
         <span class="org-rainbow-delimiters-depth-3">[</span>x 5<span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">)</span>
  #t<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Result:
</p>

<div class="org-src-container">
<pre class="src src-example">Error: struct:exn:fail:contract:variable

x: undefined;
 cannot use before initialization
</pre>
</div>

<p>
You can see this fails at the point that we try to look up <code>x</code> during the binding
of <code>six</code>. Now using a <code>lambda</code> (and with <code>let</code> since it behaves in the same way and
this example only binds one symbol anyways):
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-comment-delimiter">; </span><span class="org-comment">loophole?</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">[</span>f <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">&#955;</span> <span class="org-rainbow-delimiters-depth-5">()</span> <span class="org-rainbow-delimiters-depth-5">(</span>+ x 1<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">)</span>
  f<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Here, <code>x</code> isn&rsquo;t bound anywhere, but <code>f</code> can still be bound and returned! But if we
actually try to evaluate <code>f</code>, we&rsquo;ll run into problems.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span class="org-comment-delimiter">; </span><span class="org-comment">=&gt; Error: struct:exn:fail:contract</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">let</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">[</span>f <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">&#955;</span> <span class="org-rainbow-delimiters-depth-5">()</span> <span class="org-rainbow-delimiters-depth-5">(</span>+ x 1<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span>f<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
</div>
</p>
</div>
<div id="postamble" class="status">
<a href="archive.html">Archive</a>
</div>
</body>
</html>
